Repository: SaahBrice/gistme_backend
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: While we strive for accuracy, we cannot guarantee that all information is error-free. Users should independently verify critical information, especially regarding deadlines, requirements, and official announcements.
fr: Bien que nous nous efforcions d'être exacts, nous ne pouvons garantir que toutes les informations sont sans erreur. Les utilisateurs doivent vérifier indépendamment les informations critiques, notamment concernant les délais, exigences et annonces officielles.

source: We reserve the right to modify these terms at any time. Continued use of the service after changes constitutes acceptance of the new terms.
fr: Nous nous réservons le droit de modifier ces conditions à tout moment. L'utilisation continue du service après les modifications constitue l'acceptation des nouvelles conditions.

source: For questions about these terms, contact us via WhatsApp at
fr: Pour toute question concernant ces conditions, contactez-nous via WhatsApp au

source: Why Gist4U
fr: Pourquoi Gist4U

source: The Numbers Speak
fr: Les Chiffres Parlent

source: Real impact for real people
fr: Un impact réel pour de vraies personnes

source: Hours Saved Daily
fr: Heures Économisées/Jour

source: Curated content means less scrolling, more learning
fr: Contenu sélectionné signifie moins de défilement, plus d'apprentissage

source: To Get Informed
fr: Pour S'informer

source: AI summaries deliver key information fast
fr: Les résumés IA livrent les infos clés rapidement

source: Missed Deadlines
fr: Dates Limite Manquées

source: Smart alerts ensure you never miss an opportunity
fr: Les alertes intelligentes garantissent que vous ne manquez jamais une opportunité

source: News
fr: Actualités

source: Opportunities
fr: Opportunités

source: For You
fr: Pour Vous

source: My Quote of Today
fr: Ma Citation du Jour

source: Relax Here
fr: Détendez-vous

source: Mentor Me
fr: Mentorez-moi

source: Sponsors & Partners
fr: Sponsors & Partenaires

source: Account
fr: Compte

source: Name
fr: Nom

source: Region
fr: Région

source: Education Level
fr: Niveau d'Études

source: Background
fr: Formation

source: Interests
fr: Intérêts

source: Notification Time
fr: Heure de Notification

source: Push Notifications
fr: Notifications Push

source: Language
fr: Langue

source: Quote of the Day
fr: Citation du Jour

source: Receive Daily Quotes
fr: Recevoir des Citations Quotidiennes

source: Quote Category
fr: Catégorie de Citation

source: Custom Desires
fr: Souhaits Personnalisés

source: Tell us what you're looking for
fr: Dites-nous ce que vous recherchez

source: Save Changes
fr: Enregistrer les Modifications

source: Saving...
fr: Enregistrement...

source: Account Actions
fr: Actions du Compte

source: Log Out
fr: Déconnexion

source: Delete Account
fr: Supprimer le Compte

source: Terms & Privacy Policy
fr: Conditions & Politique de Confidentialité

source: No bookmarks yet
fr: Pas encore de signets

source: Articles you bookmark will appear here
fr: Les articles que vous mettez en signet apparaîtront ici

source: Gist, based on your interest
fr: Gist, basé sur vos intérêts

source: No gist yet
fr: Pas encore de gist

source: Set your custom desires in Settings to get personalized gist
fr: Définissez vos souhaits personnalisés dans Paramètres pour obtenir des gists personnalisés

source: Thank You!
fr: Merci !

source: Your inquiry has been received. Our founder will personally get in touch with you soon.
fr: Votre demande a été reçue. Notre fondateur vous contactera personnellement bientôt.

source: Close
fr: Fermer

source: Partner with us or sponsor our mission to connect Cameroonians with opportunities.
fr: Associez-vous à nous ou parrainez notre mission de connecter les Camerounais aux opportunités.

source: What would you like to do?
fr: Que souhaitez-vous faire ?

source: Partner
fr: Partenaire

source: Both
fr: Les Deux

source: Your Information
fr: Vos Informations

source: Full Name
fr: Nom Complet

source: Organization
fr: Organisation

source: Optional
fr: Optionnel

source: Company/Organization Name
fr: Nom de l'Entreprise/Organisation

source: Website
fr: Site Web

source: Tell Us More
fr: Dites-nous en Plus

source: Send
fr: Envoyer

source: Sending...
fr: Envoi...

source: Share
fr: Partager

source: Terms & Privacy
fr: Conditions & Confidentialité

source: Terms of Service
fr: Conditions d'Utilisation

source: By using Gist4U, you agree to these terms. We provide curated opportunities including scholarships, jobs, and competitions.
fr: En utilisant Gist4U, vous acceptez ces conditions. Nous fournissons des opportunités sélectionnées incluant bourses, emplois et concours.

source: Privacy Policy
fr: Politique de Confidentialité

source: We collect your email, phone, and preferences to personalize your experience. Your data is stored securely and never sold.
fr: Nous collectons votre email, téléphone et préférences pour personnaliser votre expérience. Vos données sont stockées en sécurité et jamais vendues.

source: By enabling notifications, you consent to receiving updates about opportunities matching your interests.
fr: En activant les notifications, vous consentez à recevoir des mises à jour sur les opportunités correspondant à vos intérêts.

source: Questions? Email us at
fr: Questions ? Écrivez-nous à

source: Delete Account?
fr: Supprimer le Compte ?

source: To delete your account, contact us:
fr: Pour supprimer votre compte, contactez-nous :

source: Got it
fr: Compris

source: Settings saved successfully!
fr: Paramètres enregistrés avec succès !

source: More for you
fr: Plus pour vous

source: Timeline
fr: Chronologie

source: Share this article
fr: Partager cet article

source: Download Image
fr: Télécharger l'Image

source: Gist Assistant
fr: Assistant Gist

source: Ask me about this article
fr: Posez-moi des questions sur cet article

source: Never Miss Any Opportunity Anymore!
fr: Ne Manquez Plus Jamais Aucune Opportunité !

source: You'll never miss any opportunity again. Get alerts for scholarships, jobs, exam results, and hot gist.
fr: Vous ne manquerez plus jamais aucune opportunité. Recevez des alertes pour les bourses, emplois, résultats d'examens et les dernières infos.

source: Delivered to your email & phone
fr: Livré sur votre email & téléphone

source: Phone Number
fr: Numéro de Téléphone

source: Email Address
fr: Adresse Email

source: What kind of gist do you want?
fr: Quel type de gist voulez-vous ?

source: Coupon Code
fr: Code Promo

source: Apply
fr: Appliquer

source: Just 1,500 FCFA / 3 months
fr: Seulement 1 500 FCFA / 3 mois

source: Back
fr: Retour

source: Processing...
fr: Traitement...

source: Please wait while we process your subscription
fr: Veuillez patienter pendant que nous traitons votre abonnement

source: You're all set! You'll now receive priority alerts for scholarships, jobs, exam results, and exclusive gist directly to your phone and email.
fr: Vous êtes paré ! Vous recevrez désormais des alertes prioritaires pour les bourses, emplois, résultats d'examens et gists exclusifs directement sur votre téléphone et email.

source: Subscription Active
fr: Abonnement Actif

source: Valid until:
fr: Valide jusqu'au :

source: Explore Your Feed
fr: Explorez Votre Fil

source: You're Already Pro!
fr: Vous Êtes Déjà Pro !

source: Great news! You already have an active Pro subscription. No need to subscribe again.
fr: Bonne nouvelle ! Vous avez déjà un abonnement Pro actif. Pas besoin de vous réabonner.

source: Pro Subscription Active
fr: Abonnement Pro Actif

source: Go to Feed
fr: Aller au Fil

source: Free Forever
fr: Gratuit à Vie

source: Welcome back! Sign in to continue
fr: Bon retour ! Connectez-vous pour continuer

source: Continue with Google
fr: Continuer avec Google

source: or use email
fr: ou utilisez votre email

source: Sign In
fr: Connexion

source: New here?
fr: Nouveau ici ?

source: Create an account
fr: Créer un compte

source: Create your free account
fr: Créez votre compte gratuit

source: Sign up with Google
fr: S'inscrire avec Google

source: At least 8 characters
fr: Au moins 8 caractères

source: Create Account
fr: Créer le Compte

source: Already have an account?
fr: Vous avez déjà un compte ?

source: Sign in
fr: Connexion

source: Get Cameroon's hottest gist in 60 seconds
fr: Obtenez les dernières nouvelles du Cameroun en 60 secondes

source: Available Mentors
fr: Mentors Disponibles

source: read more
fr: lire plus

source: show less
fr: voir moins

source: No mentors found
fr: Aucun mentor trouvé

source: Try a different category
fr: Essayez une autre catégorie

source: Welcome to Mentor Me
fr: Bienvenue dans Mentor Me

source: Tap to hear about our mentorship program
fr: Appuyez pour découvrir notre programme de mentorat

source: Let's personalize your experience
fr: Personnalisons votre expérience

source: Let's Go
fr: C'est parti

source: Let's get started
fr: Commençons

source: Your phone & where you're based
fr: Votre téléphone et votre localisation

source: Your Region
fr: Votre Région

source: Continue
fr: Continuer

source: What interests you?
fr: Qu'est-ce qui vous intéresse ?

source: Select all that apply
fr: Sélectionnez tout ce qui s'applique

source: Select All
fr: Tout Sélectionner

source: About You
fr: À Propos de Vous

source: This helps us find relevant opportunities
fr: Cela nous aide à trouver des opportunités pertinentes

source: Highest Education
fr: Plus Haut Niveau d'Études

source: Your Background
fr: Votre Formation

source: When to notify you?
fr: Quand vous notifier ?

source: Pick your preferred time
fr: Choisissez votre heure préférée

source: Anything else?
fr: Autre chose ?

source: Tell us your specific needs (optional)
fr: Dites-nous vos besoins spécifiques (optionnel)

source: Be specific! This helps us find exactly what you need.
fr: Soyez précis ! Cela nous aide à trouver exactement ce dont vous avez besoin.

source: Save & Go
fr: Enregistrer & Continuer

source: Skip for now
fr: Passer pour l'instant

source: Welcome to Pro!
fr: Bienvenue dans Pro !

source: Payment Failed
fr: Paiement Échoué

source: Try Again
fr: Réessayer

source: Level
fr: Niveau

source: Search
fr: Rechercher

source: Search articles...
fr: Rechercher des articles...

source: Searching...
fr: Recherche en cours...

source: Find what interests you
fr: Trouvez ce qui vous intéresse

source: Search for news, scholarships, jobs, and more
fr: Recherchez des actualités, bourses, emplois et plus

source: No results found
fr: Aucun résultat trouvé

source: Try different keywords or check your spelling
fr: Essayez d'autres mots-clés ou vérifiez l'orthographe

source: Load More
fr: Charger Plus

source: Loading...
fr: Chargement...

source: Get Assistance
fr: Obtenir de l'aide

source: Need help with this opportunity? Tell us how we can assist you.
fr: Besoin d'aide avec cette opportunité? Dites-nous comment nous pouvons vous aider.

source: Describe what help you need (e.g., I need help preparing my application documents...)
fr: Décrivez l'aide dont vous avez besoin (ex: J'ai besoin d'aide pour préparer mes documents de candidature...)

source: Your name (optional)
fr: Votre nom (facultatif)

source: WhatsApp number (recommended)
fr: Numéro WhatsApp (recommandé)

source: Send Request
fr: Envoyer la demande

source: My Quote of the Day
fr: Ma Citation du Jour

source: Daily inspiration to fuel your ambition
fr: Inspiration quotidienne pour alimenter votre ambition

source: Loading your quote...
fr: Chargement de votre citation...

source: No Quote Available
fr: Aucune Citation Disponible

source: Check back tomorrow for your daily inspiration.
fr: Revenez demain pour votre inspiration quotidienne.

source: Back to Feed
fr: Retour au Fil

source: What This Means
fr: Ce Que Cela Signifie

source: Words of Affirmation
fr: Paroles d'Affirmation

source: Share This Quote
fr: Partager Cette Citation

source: Share Quote
fr: Partager la Citation

source: Share as Image
fr: Partager en Image

source: Download beautiful image
fr: Télécharger une belle image

source: Copy Text
fr: Copier le Texte

source: Copy quote to clipboard
fr: Copier la citation dans le presse-papier

source: Share Link
fr: Partager le Lien

source: Share page link
fr: Partager le lien de la page

source: Previous Quotes
fr: Citations Précédentes

source: Meaning
fr: Signification

source: Tap to expand
fr: Appuyez pour développer

source: Tap to collapse
fr: Appuyez pour réduire

source: More quotes coming...
fr: D'autres citations à venir...
